Repository: DuyBao02/EcoMap
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: de, vi

source: Please upload an image before submitting.
de: Bitte laden Sie vor dem Absenden ein Bild hoch.
vi: Vui lòng tải lên một hình ảnh trước khi gửi.

source: Do you want to upload the image?
de: Möchten Sie das Bild hochladen?
vi: Bạn muốn tải ảnh lên không?

source: Only files in .jpeg, .jpg and .png formats are allowed!
vi: Chỉ cho phép các tệp có định dạng .jpeg, .jpg và .png!

source: Image cannot be found
de: Bild kann nicht gefunden werden
vi: Hình ảnh không được tìm thấy

source: No masks detected, try again!
de: Keine Masken erkannt, versuchen Sie es erneut!
vi: Không phát hiện thấy mặt nạ nào, hãy thử lại!

source: Error
de: Fehler
vi: Lỗi

source: Something's missing.
de: Irgendetwas stimmte nicht.
vi: Có gì đó không đúng.

source: Sorry, we can't find that page. You'll find lots to explore on the home page.
de: Leider können wir diese Seite nicht finden. Auf der Startseite gibt es viel zu entdecken.
vi: Rất tiếc, chúng tôi không tìm thấy trang. Bạn sẽ tìm thấy nhiều nội dung để khám phá trên trang chủ.

source: Back to Homepage
de: Zurück zur Startseite
vi: Quay lại trang chủ

source: All Rights Reserved
de: Alle Rechte vorbehalten.
vi: Mọi bản quyền được bảo lưu

source: Home
de: Startseite
vi: Trang chủ

source: Contacts
de: Kontakte
vi: Liên lạc

source: Polygon Detect Successful
de: Polygonerkennung erfolgreich
vi: Phát hiện đa giác

source: Image Has Been Recognized
de: Bild wurde erkannt
vi: Hình ảnh đã được nhận dạng

source: You can download 1 or more image
de: Sie können 1 oder mehrere Bilder herunterladen
vi: Bạn có thể tải 1 hoặc nhiều ảnh

source: Original Image
de: Originalbild
vi: Ảnh Gốc

source: Detected Polygons
de: Erkannte Polygone
vi: Đa giác đã phát hiện

source: Original Area:
de: Ursprünglicher Bereich:
vi: Diện tích ban đầu:

source: Number of detected images:
de: Anzahl der erkannten Bilder:
vi: Số đa giác được phát hiện:

source: Total Area of Polygons:
de: Gesamtfläche der Polygone:
vi: Tổng diện tích của đa giác:

source: Total Percentage of Polygons:
de: Gesamtprozentsatz der Polygone:
vi: Tổng phần trăm đa giác:

source: Download ZIP
de: ZIP herunterladen
vi: Tải ZIP

source: No detected images available
de: Keine erkannten Bilder verfügbar
vi: Không có ảnh nào được phát hiện

source: Detect polygons on map
de: Polygone auf der Karte erkennen
vi: Phát hiện đa giác trên bản đồ

source: Detecting With Map
de: Erkennen mit Karte
vi: Phát Hiện Với Hình Ảnh

source: Enter a location
de: Geben Sie einen Ort ein
vi: Nhập vị trí

source: Search
de: Suchen
vi: Tìm

source: INPUT YOUR IMAGE
de: LADEN SIE IHR BILD HOCH
vi: ĐẶT ẢNH CỦA BẠN VÀO

source: Click Here
de: Hier klicken
vi: Bấm Vào Đây

source: You can paste an image from your clipboard!
de: Sie können ein Bild aus Ihrer Zwischenablage einfügen!
vi: Bạn có thể dán hình ảnh từ clipboard của mình!

source: Upload another image
de: Laden Sie ein weiteres Bild hoch
vi: Tải lên một ảnh khác

source: Loading...
de: Laden...
vi: Đang tải...

source: Submit
de: Einreichen
vi: Gửi

source: Vietnamese Chatbot supports Can Tho location
de: Vietnamesischer Chatbot unterstützt Standort Can Tho
vi: Chatbot tiếng Việt hỗ trợ địa điểm Cần Thơ

source: Type a message...
de: Geben Sie eine Nachricht ein...
vi: Nhập tin nhắn...

source: Send
de: Schicken
vi: Gửi

source: Contact
de: Kontakte
vi: Liên lạc

source: Can Tho University Zone II
de: Universität Can Tho, Zone II
vi: Trường Đại Học Cần Thơ Khu 2

source: Đ. 3/2, Xuan Khanh, Ninh Kieu, Can Tho
vi: Đ. 3/2, Xuân Khánh, Ninh Kiều, Cần Thơ

source: School of Information and Communication Technology
de: Schule für Informations- und Kommunikationstechnologie
vi: Trường Công Nghệ Thông Tin Và Truyền Thông

source: Frequently Asked Questions
vi: Câu Hỏi Thường Gặp

source: What's EcoMap?
vi: EcoMap là gì?

source: EcoMap is a system that helps identify and analyze buildings from satellite images and provides administrative information such as population, area, or tourist attractions through an integrated chatbot.
vi: EcoMap là hệ thống giúp nhận dạng và phân tích các tòa nhà từ hình ảnh vệ tinh và cung cấp thông tin hành chính như dân số, diện tích hoặc điểm tham quan du lịch thông qua chatbot tích hợp.

source: How to upload and analyze images?
vi: Làm thế nào để tải lên và phân tích ảnh?

source: There are 2 ways for you to do this:
vi: Có 2 cách để bạn thực hiện:

source: You can find the location you want to analyze on the integrated map, take a photo with a computer tool. Then paste the photo below for the system to analyze.
vi: Bạn có thể tìm vị trí cần phân tích trên bản đồ tích hợp, chụp ảnh bằng công cụ máy tính. Sau đó dán ảnh bên dưới để hệ thống phân tích.

source: If you already have a photo, you can upload it using the 'Click here' button or paste the photo from the clipboard into the interface. Then press the 'Send' button for the system to identify and provide information.
vi: Nếu bạn đã có ảnh, bạn có thể tải ảnh lên bằng cách sử dụng nút 'Nhấp vào đây' hoặc dán ảnh từ bảng tạm vào giao diện. Sau đó nhấn nút 'Gửi' để hệ thống nhận dạng và cung cấp thông tin.

source: Is the accuracy of identification and analysis high?
vi: Độ chính xác của việc nhận dạng và phân tích có cao không?

source: Because the analysis and identification are trained by us on the YOLOv11m-seg model, and because the training dataset only focuses on analyzing sparse, less obscured house segments. So you need to find areas with suitable conditions for the system to analyze accurately.
vi: Vì phân tích và nhận dạng được chúng tôi đào tạo trên mô hình YOLOv11m-seg và vì tập dữ liệu đào tạo chỉ tập trung vào việc phân tích các phân đoạn nhà thưa thớt, ít bị che khuất. Vì vậy, bạn cần tìm các khu vực có điều kiện phù hợp để hệ thống phân tích chính xác.

source: Note that the zoom size of the image also affects the analysis results.
vi: Lưu ý, kích thước thu phóng của ảnh cũng ảnh hưởng đến kết quả phân tích.

source: Where are the satellite image analysis results stored?
vi: Kết quả phân tích ảnh vệ tinh được lưu ở đâu?

source: The recognition and analysis results will be viewed directly on the website, you can download the results to your computer.
vi: Kết quả nhận dạng và phân tích sẽ được xem trực tiếp trên website, bạn có thể tải kết quả về máy.

source: How does the chatbot work?
vi: Chatbot hoạt động như thế nào?

source: The chatbot uses artificial intelligence to answer questions related to administrative information in Can Tho city. You can type in a question or use your voice to ask for information.
vi: Chatbot sử dụng trí tuệ nhân tạo để trả lời các câu hỏi liên quan đến thông tin hành chính tại thành phố Cần Thơ. Bạn có thể nhập câu hỏi hoặc sử dụng giọng nói để yêu cầu thông tin.

source: What can I ask the chatbot?
vi: Tôi có thể hỏi chatbot những gì?

source: You can ask about:
vi: Bạn có thể hỏi về:

source: Population in districts.
vi: Dân số theo quận.

source: Area of an area.
vi: Diện tích của một khu vực.

source: Notable tourist attractions.
vi: Các điểm tham quan du lịch nổi tiếng.

source: Population density ratio in a specific area.
vi: Tỷ lệ mật độ dân cư tại một khu vực cụ thể.

source: How to report errors or suggestions?
vi: Làm thế nào để báo lỗi hoặc góp ý?

source: If you encounter errors or have suggestions, please use the 'Contact' page or send an email to
vi: Nếu bạn gặp lỗi hoặc có góp ý, vui lòng sử dụng trang 'Liên hệ' hoặc gửi email tới

source: Something was wrong.
de: Irgendetwas stimmte nicht.
